Revit 2026 API

# AssetPropertyListSetValue Method

---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValue(
	IList<AssetProperty> value
)
```
```vb
Public Sub SetValue (
	value As IList(Of AssetProperty)
)
```
```cpp
public:
void SetValue(
	IList<AssetProperty^>^ value
)
```
```fsharp
member SetValue :
        value : IList<AssetProperty> -> unit
```

#### Parameters

value IListAssetProperty

#### Reference

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace